{
  "name": "Martin Kirov",
  "location": "Plovdiv, Bulgaria",
  "email": "martinkirov9803@gmail.com",
  "phone": "+359897833385",
  "github": "https://github.com/martok9803",

  "headline": "System Administration · Cloud · Automation · Blockchain",
  "summary": [
    "I’m focused on uniting everything I’ve learned and applying it in a professional environment.",
    "I love Python scripting, Linux, cloud infrastructure, and blockchain technologies.",
    "I’m interested in face and behavior recognition as a key part of the future of human–machine interaction.",
    "I believe post-quantum encryption will soon be essential as new algorithms emerge.",
    "Curious by nature — I value my time with friends and in nature, and I try to elevate what I know every day."
  ],

  "career_goal": "Join a company that values strong talent and gives freedom to the mind and creativity — where innovation is encouraged and ideas can grow.",

  "mindset": "I embrace stress and problems because they’re the driving force of progress. As some anthropologists say, humans are meant to face pressure — those who turn it into positive momentum win (natural selection).",

  "languages": ["Bulgarian (native)", "English (fluent)", "French (conversational)"],
  "education": [
    "Language High School – Pazardzhik (Bulgarian/English/French)",
    "Electronics (former student), Technical University of Sofia"
  ],

  "interests": [
    "Fitness, mountain hiking and camping across Bulgaria — in all seasons",
    "Automation, distributed systems, security, encryption",
    "Experimenting with cloud + blockchain tooling"
  ],

  "projects": [
    {
      "name": "Face Verify Web",
      "url": "https://github.com/martok9803/face-verify-web",
      "description": "Minimal Flask-based face recognition web app — educational starter for CV/ML curious engineers."
    },
    {
      "name": "Sol Bundle",
      "url": "https://github.com/martok9803/sol-bundle",
      "description": "Jito bundling automation for advanced Solana traders; focus on performance and reliability."
    },
    {
      "name": "Terraform for Cloud State Management",
      "url": "https://github.com/martok9803/Terraform-For-Cloud-State-Management",
      "description": "Experiments with AWS + Terraform for reproducible infrastructure and state management."
    }
  ],

  "experience": [
    {
      "company": "WiPro Services",
      "role": "System Administration (Windows/Linux)",
      "location": "Vienna, Austria",
      "start": "Nov 2024",
      "end": "Sept 2025",
      "highlights": [
        "Full support and administration of Windows-based infrastructure for a hotel complex (80+ active users, several VLAN segments).",
        "Active Directory: user lifecycle, OU structure, GPOs, logon scripts, roaming profiles, security policies; integrations with Exchange, file servers and internal apps.",
        "Windows Server (2019/2022): AD DS, DNS, DHCP, Group Policy, Print Services; update strategy, backups, performance monitoring.",
        "Password, access and security policies aligned with GDPR requirements.",
        "Network administration: VLAN segmentation (guests, staff, admin, POS), L3 switches, VPN tunnels; firewall policies, internet access control, QoS, logging."
      ]
    },
    {
      "company": "WorkNomads",
      "role": "Windows System Administrator",
      "location": "Sofia, Bulgaria",
      "start": "Feb 2024",
      "end": "Oct 2024",
      "highlights": [
        "Designed and deployed multi-VLAN networks with distinct access levels (guests, admin, IP telephony, CCTV, etc.).",
        "Integrated and configured SALTO access control (electronic locks and permissions).",
        "Managed server services: DHCP, DNS, file/app servers, backups and monitoring.",
        "Firewall log analysis and filtering to prevent attacks and unauthorized access.",
        "Wi-Fi/LAN operations: switches, routers, APs, PoE devices; QoS tuning and throughput optimization."
      ]
    },
    {
      "company": "Sutherland",
      "role": "Technical Support Specialist – Networking",
      "location": "Sofia, Bulgaria",
      "start": "Jul 2023",
      "end": "Jan 2024",
      "highlights": [
        "Phone and online support for first-time mesh setup and device onboarding.",
        "Eero networks: SSID, bridge/router modes, ISP integration and troubleshooting (latency, stability, coverage).",
        "Helped connect smart devices (cameras, assistants, TVs) to Wi-Fi and improved coverage plans.",
        "Clear documentation and CRM ticketing for traceable, high-quality support."
      ]
    }
  ]
}
